Repository: danabr/mlfe
Catalog: priv/lang/alpaca.*.po
Languages: es_mx, sv_se

source: builtin_type_arity_error %(num_expected) %(num_supplied)
es_mx: Número incorrecto de parámetros de tipo proporcionados para el tipo incorporado "%(type)". Se esperaba $(num_expected), pero se consiguió %(num_supplied).

source: duplicate_definition %(id)
es_mx: Definición duplicada de "%(id)".

source: duplicate_type_definition %(id)
es_mx: Tipo "%(id)" ya se ha definido.

source: function_not_exported %(mod) %(name)
es_mx: No hay ninguna función "%(fun)" que se exporte desde el módulo "%(mod)".

source: incomplete_expression
es_mx: Final inesperado de la expresión.

source: invalid_bin_qualifier %(qualifier)
es_mx: Calificador binario no válido "%(qualifier)". Los calificadores válidos son "end", "sign", "size", "type" y "unit".

source: invalid_bin_type %(type)
es_mx: Tipo de parte binaria no válido "%(type)." Los tipos válidos son "binary", "float", "int" y "utf8".

source: invalid_endianness %(endianness)
es_mx: Endianidad no válido "%{endianness}". Quiso decir "big", "little", o "native"?

source: invalid_fun_parameter
es_mx: Patrón inválido para el argumento de la función.

source: invalid_top_level_construct
es_mx: Esta construcción no puede aparecer en el nivel superior.

source: module_rename %(old) %(new).
es_mx: Renombración del nombre del módulo de "%(old)" a "%(new)".

source: no_module
es_mx: El módulo no tiene nombre. Se puede definirlo así: "module foo".

source: no_module %(mod)
es_mx: No se puede encontrar ningún módulo llamado "%(mod)".

source: type_parameter_given_to_primitive_builtin_type %(type)
es_mx: Parámetro de tipo proporcionado para el tipo incorporado "%(type)", pero no se esperaba ninguno.

source: unexpected_token %(token)
es_mx: Error de sintaxis antes de "%(token)".

source: unknown_error %(raw_error_term)
es_mx: %(raw_error_term) Discúlpenos, aun no tenemos un mensaje apropiado para este error. Por favor, considere enviar un problema a https://www.github.com/alpaca-lang/alpaca.

source: %(raw_error_term) Sorry, we do not have a proper message for this error yet. Please consider filing an issue at https://www.github.com/alpaca-lang/alpaca.
sv_se: %(raw_error_term) Vi saknar felmeddande för detta fel. Vänligen överväg att rapportera detta på https://www.github.com/alpaca-lang/alpaca.

source: Cannot find module "%(mod)".
sv_se: Kunde inte hitta modulen "%(mod)".

source: Duplicate definitition of "%(id)".
sv_se: Identifieraren "%(id)" används redan.

source: Duplicate definitition of type "%(id)".
sv_se: Det finns redan en typ med namnet "%(id)".

source: Incomplete expression.
sv_se: Uttrycket är inte komplett.

source: Invalid binary part type "%(type)". Valid types are "binary", "float", "int", and "utf8".
sv_se: Ogiltig binärdelstyp "%(type)". Giltiga typer är "binary", "float", "int", och "utf8".

source: Invalid binary qualifier "%(qualifier)". Valid qualifiers are "end", "sign", "size", "type" and "unit".
sv_se: Ogiltigt binärattribut "%(qualifier)." Giltig attribut är' "end", "sign", "size", "type" och "unit".

source: Invalid endianess "%(endianess)".Did you mean "big", "little", or "native"?
sv_se: Okänd byte-ordning. Menade du "bi", "little", eller "native"?

source: Invalid pattern for function argument.
sv_se: Ogiltigt mönster för funktionsargument.

source: Invalid top level construct.
sv_se: Det här uttrycket får inte förekomma på toppnivån.

source: No function %(fun) exported from module %(mod).
sv_se: Modulen %(mod) exporterar ingen funktion med namnet %(fun).

source: No module name defined. You may define it like this: "module foo"
sv_se: Du har inte angivit något modulnamn. Du kan ange det så här: module foo

source: Redefintion of module name from "%(old)" to "%(new)".
sv_se: Försök att ange namn på en redan angiven modul. Existerande namn: "%(old)". Nytt namn: "%(new)".

source: Type parameter provided for builtin type %(type), but none was expected.
sv_se: Du har angivit typparametrar till den inbygga typen %(type), men denna typ tar inga typparameterar.

source: Unexpected token "%(token)".
sv_se: Oväntat ord "%(token)".

source: Wrong number of type parameters provided for builtin type %(type). Expected %(num_expected), but got %(num_supplied).
sv_se: Du har angivit fel antal typparametrar till den inbyggda typen %(type). Förväntat antal parametrar: %(num_expected). Angivet antal parametrar: %(num_supplied).
